LongDo1902/STM32_UAV_SpeedyBee_F405/Module/imu/core/icm42688_registers.h
/*
 * icm42688_registers.h
 *
 *  Created on: Feb 14, 2026
 *      Author: dobaolong
 */

#ifndef INC_IMU_ICM42688_REGISTERS_H_
#define INC_IMU_ICM42688_REGISTERS_H_

#include <stdint.h>

/* ===================================================================================
 *	ICM42688 REGISTER MAP (UB0)
 * =================================================================================== */

// REG_BANK_SEL Defines
typedef enum
{
    REG_BANK_0   = 0x00U,
    REG_BANK_1   = 0x01U,
    REG_BANK_2   = 0x02U,
    REG_BANK_3   = 0x03U,
    REG_BANK_4   = 0x04U,
    UNKNOWN_BANK = 0x07U
} ICM42688_RegBank_t;

typedef uint16_t ICM42688_Reg_t;
#define ICM42688_REG(bank, addr)    ((ICM42688_Reg_t)((((uint16_t)(bank)) << 8) | ((uint8_t)(addr))))
#define ICM42688_REG_BANK(r)        ((ICM42688_RegBank_t)(((r) >> 8) & 0xFF))
#define ICM42688_REG_ADDR(r)        ((uint8_t)((r) & 0xFF))

#define ICM42688_UB0_DEVICE_CONF        ICM42688_REG(REG_BANK_0, 0x11)
#define ICM42688_UB0_DRIVE_CONF         ICM42688_REG(REG_BANK_0, 0x13)
#define ICM42688_UB0_INT_CONF           ICM42688_REG(REG_BANK_0, 0x14)
#define ICM42688_UB0_FIFO_CONF          ICM42688_REG(REG_BANK_0, 0x16)
#define ICM42688_UB0_SIGNAL_PATH_RST    ICM42688_REG(REG_BANK_0, 0x4B)
#define ICM42688_UB0_INTF_CONF0         ICM42688_REG(REG_BANK_0, 0x4C)
#define ICM42688_UB0_INTF_CONF1         ICM42688_REG(REG_BANK_0, 0x4D)
#define ICM42688_UB0_PWR_MGMT0          ICM42688_REG(REG_BANK_0, 0x4E)

// Interrupt & FIFO Status
#define ICM42688_UB0_INT_STATUS         ICM42688_REG(REG_BANK_0, 0x2D)
#define ICM42688_UB0_INT_STATUS2        ICM42688_REG(REG_BANK_0, 0x37)
#define ICM42688_UB0_INT_STATUS3        ICM42688_REG(REG_BANK_0, 0x38)
#define ICM42688_UB0_FIFO_COUNTH        ICM42688_REG(REG_BANK_0, 0x2E)
#define ICM42688_UB0_FIFO_COUNTL        ICM42688_REG(REG_BANK_0, 0x2F)
#define ICM42688_UB0_FIFO_DATA          ICM42688_REG(REG_BANK_0, 0x30)

// Sensor Configuration
#define ICM42688_UB0_GYRO_CONF0         ICM42688_REG(REG_BANK_0, 0x4F)
#define ICM42688_UB0_GYRO_CONF1         ICM42688_REG(REG_BANK_0, 0x51)
#define ICM42688_UB0_ACCEL_CONF0        ICM42688_REG(REG_BANK_0, 0x50)
#define ICM42688_UB0_ACCEL_CONF1        ICM42688_REG(REG_BANK_0, 0x53)
#define ICM42688_UB0_GYRO_ACCEL_CONF0   ICM42688_REG(REG_BANK_0, 0x52)

// APEX & Features
#define ICM42688_UB0_APEX_DATA0     ICM42688_REG(REG_BANK_0, 0x31)
#define ICM42688_UB0_APEX_DATA1     ICM42688_REG(REG_BANK_0, 0x32)
#define ICM42688_UB0_APEX_DATA2     ICM42688_REG(REG_BANK_0, 0x33)
#define ICM42688_UB0_APEX_DATA3     ICM42688_REG(REG_BANK_0, 0x34)
#define ICM42688_UB0_APEX_DATA4     ICM42688_REG(REG_BANK_0, 0x35)
#define ICM42688_UB0_APEX_DATA5     ICM42688_REG(REG_BANK_0, 0x36)
#define ICM42688_UB0_APEX_CONF      ICM42688_REG(REG_BANK_0, 0x56)
#define ICM42688_UB0_SMD_CONF       ICM42688_REG(REG_BANK_0, 0x57)

// Advanced Controls
#define ICM42688_UB0_TMST_FSYNCH    ICM42688_REG(REG_BANK_0, 0x2B)
#define ICM42688_UB0_TMST_FSYNCL    ICM42688_REG(REG_BANK_0, 0x2C)
#define ICM42688_UB0_TMST_CONF      ICM42688_REG(REG_BANK_0, 0x54)
#define ICM42688_UB0_FIFO_CONF1     ICM42688_REG(REG_BANK_0, 0x5F)
#define ICM42688_UB0_FIFO_CONF2     ICM42688_REG(REG_BANK_0, 0x60)
#define ICM42688_UB0_FIFO_CONF3     ICM42688_REG(REG_BANK_0, 0x61)
#define ICM42688_UB0_FSYNC_CONF     ICM42688_REG(REG_BANK_0, 0x62)

// Interrupt Sources
#define ICM42688_UB0_INT_CONF0      ICM42688_REG(REG_BANK_0, 0x63)
#define ICM42688_UB0_INT_CONF1      ICM42688_REG(REG_BANK_0, 0x64)
#define ICM42688_UB0_INT_SRC0       ICM42688_REG(REG_BANK_0, 0x65)
#define ICM42688_UB0_INT_SRC1       ICM42688_REG(REG_BANK_0, 0x66)
#define ICM42688_UB0_INT_SRC3       ICM42688_REG(REG_BANK_0, 0x68)
#define ICM42688_UB0_INT_SRC4       ICM42688_REG(REG_BANK_0, 0x69)

// System
#define ICM42688_UB0_FIFO_LOST_PKT0     ICM42688_REG(REG_BANK_0, 0x6C)
#define ICM42688_UB0_FIFO_LOST_PKT1     ICM42688_REG(REG_BANK_0, 0x6D)
#define ICM42688_UB0_SELFTEST_CONF      ICM42688_REG(REG_BANK_0, 0x70)
#define ICM42688_UB0_WHO_AM_I           ICM42688_REG(REG_BANK_0, 0x75)
#define ICM42688_UB0_REG_BANK_SEL       ICM42688_REG(REG_BANK_0, 0x76)

// Sensor Data (High / Low byte pairs)
#define ICM42688_UB0_TEMP_DATA1     ICM42688_REG(REG_BANK_0, 0x1D)
#define ICM42688_UB0_TEMP_DATA0     ICM42688_REG(REG_BANK_0, 0x1E)

#define ICM42688_UB0_ACCEL_DATA_X1  ICM42688_REG(REG_BANK_0, 0x1F)
#define ICM42688_UB0_ACCEL_DATA_X0  ICM42688_REG(REG_BANK_0, 0x20)
#define ICM42688_UB0_ACCEL_DATA_Y1  ICM42688_REG(REG_BANK_0, 0x21)
#define ICM42688_UB0_ACCEL_DATA_Y0  ICM42688_REG(REG_BANK_0, 0x22)
#define ICM42688_UB0_ACCEL_DATA_Z1  ICM42688_REG(REG_BANK_0, 0x23)
#define ICM42688_UB0_ACCEL_DATA_Z0  ICM42688_REG(REG_BANK_0, 0x24)

#define ICM42688_UB0_GYRO_DATA_X1   ICM42688_REG(REG_BANK_0, 0x25)
#define ICM42688_UB0_GYRO_DATA_X0   ICM42688_REG(REG_BANK_0, 0x26)
#define ICM42688_UB0_GYRO_DATA_Y1   ICM42688_REG(REG_BANK_0, 0x27)
#define ICM42688_UB0_GYRO_DATA_Y0   ICM42688_REG(REG_BANK_0, 0x28)
#define ICM42688_UB0_GYRO_DATA_Z1   ICM42688_REG(REG_BANK_0, 0x29)
#define ICM42688_UB0_GYRO_DATA_Z0   ICM42688_REG(REG_BANK_0, 0x2A)


/* ===================================================================================
 *	ICM42688 REGISTER MAP (UB1)
 * =================================================================================== */
#define ICM42688_UB1_SENSOR_CONF0       ICM42688_REG(REG_BANK_1, 0x03)
#define ICM42688_UB1_GYRO_CONF_STATIC2  ICM42688_REG(REG_BANK_1, 0x0B)
#define ICM42688_UB1_GYRO_CONF_STATIC3  ICM42688_REG(REG_BANK_1, 0x0C)
#define ICM42688_UB1_GYRO_CONF_STATIC4  ICM42688_REG(REG_BANK_1, 0x0D)
#define ICM42688_UB1_GYRO_CONF_STATIC5  ICM42688_REG(REG_BANK_1, 0x0E)
#define ICM42688_UB1_GYRO_CONF_STATIC6  ICM42688_REG(REG_BANK_1, 0x0F)
#define ICM42688_UB1_GYRO_CONF_STATIC7  ICM42688_REG(REG_BANK_1, 0x10)
#define ICM42688_UB1_GYRO_CONF_STATIC8  ICM42688_REG(REG_BANK_1, 0x11)
#define ICM42688_UB1_GYRO_CONF_STATIC9  ICM42688_REG(REG_BANK_1, 0x12)
#define ICM42688_UB1_GYRO_CONF_STATIC10 ICM42688_REG(REG_BANK_1, 0x13)

#define ICM42688_UB1_XG_ST_DATA     ICM42688_REG(REG_BANK_1, 0x5F)
#define ICM42688_UB1_YG_ST_DATA     ICM42688_REG(REG_BANK_1, 0x60)
#define ICM42688_UB1_ZG_ST_DATA     ICM42688_REG(REG_BANK_1, 0x61)
#define ICM42688_UB1_TMST_VAL0      ICM42688_REG(REG_BANK_1, 0x62)
#define ICM42688_UB1_TMST_VAL1      ICM42688_REG(REG_BANK_1, 0x63)
#define ICM42688_UB1_TMST_VAL2      ICM42688_REG(REG_BANK_1, 0x64)

#define ICM42688_UB1_INTF_CONF4     ICM42688_REG(REG_BANK_1, 0x7A)
#define ICM42688_UB1_INTF_CONF5     ICM42688_REG(REG_BANK_1, 0x7B)
#define ICM42688_UB1_INTF_CONF6     ICM42688_REG(REG_BANK_1, 0x7C)


/* ===================================================================================
 *	ICM42688 REGISTER MAP (UB2)
 * =================================================================================== */
#define ICM42688_UB2_ACCEL_CONF_STATIC2     ICM42688_REG(REG_BANK_2, 0x03)
#define ICM42688_UB2_ACCEL_CONF_STATIC3     ICM42688_REG(REG_BANK_2, 0x04)
#define ICM42688_UB2_ACCEL_CONF_STATIC4     ICM42688_REG(REG_BANK_2, 0x05)
#define ICM42688_UB2_XA_ST_DATA             ICM42688_REG(REG_BANK_2, 0x3B)
#define ICM42688_UB2_YA_ST_DATA             ICM42688_REG(REG_BANK_2, 0x3C)
#define ICM42688_UB2_ZA_ST_DATA             ICM42688_REG(REG_BANK_2, 0x3D)


/* ===================================================================================
 *	ICM42688 REGISTER MAP (UB4)
 * =================================================================================== */
#define ICM42688_UB4_APEX_CONF1     ICM42688_REG(REG_BANK_4, 0x40)
#define ICM42688_UB4_APEX_CONF2     ICM42688_REG(REG_BANK_4, 0x41)
#define ICM42688_UB4_APEX_CONF3     ICM42688_REG(REG_BANK_4, 0x42)
#define ICM42688_UB4_APEX_CONF4     ICM42688_REG(REG_BANK_4, 0x43)
#define ICM42688_UB4_APEX_CONF5     ICM42688_REG(REG_BANK_4, 0x44)
#define ICM42688_UB4_APEX_CONF6     ICM42688_REG(REG_BANK_4, 0x45)
#define ICM42688_UB4_APEX_CONF7     ICM42688_REG(REG_BANK_4, 0x46)
#define ICM42688_UB4_APEX_CONF8     ICM42688_REG(REG_BANK_4, 0x47)
#define ICM42688_UB4_APEX_CONF9     ICM42688_REG(REG_BANK_4, 0x48)

#define ICM42688_UB4_ACCEL_WOM_X_THR    ICM42688_REG(REG_BANK_4, 0x4A)
#define ICM42688_UB4_ACCEL_WOM_Y_THR    ICM42688_REG(REG_BANK_4, 0x4B)
#define ICM42688_UB4_ACCEL_WOM_Z_THR    ICM42688_REG(REG_BANK_4, 0x4C)
#define ICM42688_UB4_INT_SRC6           ICM42688_REG(REG_BANK_4, 0x4D)
#define ICM42688_UB4_INT_SRC7           ICM42688_REG(REG_BANK_4, 0x4E)
#define ICM42688_UB4_INT_SRC8           ICM42688_REG(REG_BANK_4, 0x4F)
#define ICM42688_UB4_INT_SRC9           ICM42688_REG(REG_BANK_4, 0x50)
#define ICM42688_UB4_INT_SRC10          ICM42688_REG(REG_BANK_4, 0x51)

#define ICM42688_UB4_OFFSET_USER0   ICM42688_REG(REG_BANK_4, 0x77)
#define ICM42688_UB4_OFFSET_USER1   ICM42688_REG(REG_BANK_4, 0x78)
#define ICM42688_UB4_OFFSET_USER2   ICM42688_REG(REG_BANK_4, 0x79)
#define ICM42688_UB4_OFFSET_USER3   ICM42688_REG(REG_BANK_4, 0x7A)
#define ICM42688_UB4_OFFSET_USER4   ICM42688_REG(REG_BANK_4, 0x7B)
#define ICM42688_UB4_OFFSET_USER5   ICM42688_REG(REG_BANK_4, 0x7C)
#define ICM42688_UB4_OFFSET_USER6   ICM42688_REG(REG_BANK_4, 0x7D)
#define ICM42688_UB4_OFFSET_USER7   ICM42688_REG(REG_BANK_4, 0x7E)
#define ICM42688_UB4_OFFSET_USER8   ICM42688_REG(REG_BANK_4, 0x7F)

#endif /* INC_IMU_ICM42688_REGISTERS_H_ */
